src/ChartsOfCharacteristicTypes/ТипыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ТипыСделок</Name>
			<Comment>Типизатор измерения Сделка регистра взаиморасчетов. Описывает допустимые виды документов - сделок</Comment>
			<Type>
				<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.АктПриемаПередачиЦенныхБумаг</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
				<v8:Type>cfg:DocumentRef.ВыплатаЗарплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
				<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
				<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетОтПоставщика</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
				<v8:Type>cfg:DocumentRef.ОбслуживаниеАктива</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
				<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.ПланПоступленияДС</v8:Type>
				<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
				<v8:Type>cfg:DocumentRef.Инкассация</v8:Type>
				<v8:Type>cfg:DocumentRef.ПереоценкаВалютныхСредств</v8:Type>
				<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереплатуПоСделкам</Name>
					<Comment>Если флажок установлен, то в документе данного типа запрещено превышать сумму сделки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дебетовый</Name>
					<Comment>Дебетовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитовый</Name>
					<Comment>Кредитовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ТипыСделок/Ext/ManagerModule.bsl
// Модуль менеджера плана видов характеристик "Типы сделок"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Заполняет предопределенные элементы справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	ИмяМакета = "НастройкиПоУмолчанию";
	Макет = ПланыВидовХарактеристик.ТипыСделок.ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Не обнаружен макет начальных настроек.'"));
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		// Считаем из макета Имя, Наименование, Код, ЗапретитьПереплатуПоСделкам, Дебетовый, Кредитовый.
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрЗапретитьПереплатуПоСделкам = СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрДебетовый =	СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		СтрКредитовый =	СокрЛП(Макет.Область(НомерСтроки,7).Текст);
		СсылкаТипСделки = ПланыВидовХарактеристик.ТипыСделок[СтрИмя];
		Если СсылкаТипСделки.Пустая() Тогда
			ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении типа сделки:'") + " " + СтрНаименование 
				+ ". " + НСтр("ru = 'Указан отсутствующий элемент ПВХ Типы сделок.'"));
			Продолжить;
		Иначе
			ОбъектТипСделки = СсылкаТипСделки.ПолучитьОбъект();
		КонецЕсли;
		// Заполняем реквизиты
		Если ОбъектТипСделки.Наименование<>СтрНаименование Тогда
			ОбъектТипСделки.Наименование = СтрНаименование;
		КонецЕсли;
		ЗапретитьПереплатуПоСделкам = ?(СтрЗапретитьПереплатуПоСделкам = "Истина",Истина,Ложь);
		Если ОбъектТипСделки.ЗапретитьПереплатуПоСделкам<>ЗапретитьПереплатуПоСделкам Тогда
			ОбъектТипСделки.ЗапретитьПереплатуПоСделкам = ЗапретитьПереплатуПоСделкам;
		КонецЕсли;
		Дебетовый = ?(СтрДебетовый = "Истина",Истина,Ложь);
		Если ОбъектТипСделки.Дебетовый <>Дебетовый Тогда
			ОбъектТипСделки.Дебетовый = Дебетовый;
		КонецЕсли;
		Кредитовый = ?(СтрКредитовый = "Истина",Истина,Ложь);
		Если ОбъектТипСделки.Кредитовый <>Кредитовый Тогда
			ОбъектТипСделки.Кредитовый = Кредитовый;
		КонецЕсли;
		// Если что-то изменили, то записываем.
		Если ОбъектТипСделки.Модифицированность() Тогда
			Попытка
				ОбъектТипСделки.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Тип сделки'") +" «" + СсылкаТипСделки
					+ "» " + НСтр("ru = 'для строки'") + " " + НомерСтроки + " " + "макета" +" «" + ИмяМакета + "» " 
					+ НСтр("ru = 'не обновлена.'") + Символы.ПС + "Ошибка:" + " " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Получение разрешенных типов сделок для документа
// 
// Параметры: 
// ЭтотОбъект			- ДокументОбъект, обрабатываемый документ
// ЭтоДебетоваяСделка	- Булево, признак что это дебетовая сделка
// ЭтоКредитоваяСделка - Булево, признак что это кредитовая сделка.
// 
// Возвращаемое значение: 
// СписокЗначений - список разрешенных типов сделок для документа.
Функция ПолучитьРазрешенныеТипыСделок(ЭтоДебетоваяСделка,ЭтоКредитоваяСделка) Экспорт
	СписокТиповСделок = Новый СписокЗначений;
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТипыСделок.Ссылка,
	|	ТипыСделок.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.ТипыСделок КАК ТипыСделок";
	Если (ЭтоДебетоваяСделка) И (НЕ ЭтоКредитоваяСделка) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ТипыСделок.Кредитовый = ИСТИНА";
	ИначеЕсли (ЭтоКредитоваяСделка) И (НЕ ЭтоДебетоваяСделка) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ТипыСделок.Дебетовый = ИСТИНА";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	ВыборкаТиповСделок = Запрос.Выполнить().Выбрать();
	МассивТиповВозврат = Новый Массив;
	Пока ВыборкаТиповСделок.Следующий() Цикл
		МассивТипов = ВыборкаТиповСделок.ТипЗначения.Типы();
		Для Сч = 0 По МассивТипов.ВГраница() Цикл
			МассивТиповВозврат.Добавить(МассивТипов[Сч]);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивТиповВозврат;
КонецФункции // дкПолучитьРазрешенныеТипыСделок()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
